Terraform plan for __ibo__
<details>
<summary>Plan: 4 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.inventory-mrp-create.google_project_iam_member.token_creator_binding[0] will be created
  + resource "google_project_iam_member" "token_creator_binding" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:service-435415796196@gcp-sa-pubsub.iam.gserviceaccount.com"
      + project = "ibo-prod"
      + role    = "roles/iam.serviceAccountTokenCreator"
    }

  # module.inventory-mrp-create.google_pubsub_topic.topic[0] will be created
  + resource "google_pubsub_topic" "topic" {
      + id      = (known after apply)
      + name    = "inventory-mrp-create"
      + project = "ibo-prod"

      + message_storage_policy {
          + allowed_persistence_regions = (known after apply)
        }

      + schema_settings {
          + encoding = (known after apply)
          + schema   = (known after apply)
        }
    }

  # module.inventory_events.google_pubsub_subscription.pull_subscriptions[0] will be created
  + resource "google_pubsub_subscription" "pull_subscriptions" {
      + ack_deadline_seconds       = 10
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "inventory-management-view"
      + path                       = (known after apply)
      + project                    = "ibo-prod"
      + topic                      = "inventory-management"

      + expiration_policy {
          + ttl = (known after apply)
        }
    }

  # module.inventory_events.google_pubsub_subscription_iam_member.pull_subscription_binding[0] will be created
  + resource "google_pubsub_subscription_iam_member" "pull_subscription_binding" {
      + etag         = (known after apply)
      + id           = (known after apply)
      + member       = "serviceAccount:service-435415796196@gcp-sa-pubsub.iam.gserviceaccount.com"
      + project      = "ibo-prod"
      + role         = "roles/pubsub.subscriber"
      + subscription = "inventory-management-view"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Warning: Provider kubernetes is undefined

  on jumpbox.tf line 3, in module "jumpbox":
   3:     kubernetes = kubernetes.gke

Module module.jumpbox does not declare a provider named kubernetes.
If you wish to specify a provider configuration for the module, add an entry
for kubernetes in the required_providers block within the module.
```
</details>

:memo: Plan generated in [Terraform #378](https://github.com/ebomart/commerce-infrastructure/actions/runs/1637104544)